laba11/app/controllers/pals_controller.rb

  def all
    @res = Pal.all
---
SELECT "pals".* FROM "pals"

  def output
    @pal = Pal.where(count: @text).first_or_create
---
INSERT INTO "pals" ("count", "res", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["count", 3], ["res", "[153,370,371,407]"], ["created_at", "2018-12-27 01:38:03.670484"], ["updated_at", "2018-12-27 01:38:03.670484"]]
SELECT  "pals".* FROM "pals" WHERE "pals"."count" = ? ORDER BY "pals"."id" ASC LIMIT ?  [["count", 2], ["LIMIT", 1]]